thesnowpear/kitchen-agent-based-on-esp32s3/sdkconfig.defaults
# ESP32-S3-DevKitC-1 N8R8: 8MB Flash + 8MB PSRAM
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"

# 使用自定义 8MB 分区表：双 OTA、LittleFS、本地 coredump。
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# OTA 回滚：升级失败可回退，适合后续远程运维。
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_APP_ROLLBACK_ENABLE=y

# N8R8 模组常见为 8MB Octal PSRAM；保守使用 80MHz，不启用 120MHz 实验频率。
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_ESPPSRAM64=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MEMTEST=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# 现场调试保留 brownout 和 flash coredump，方便定位供电、看门狗和堆栈问题。
CONFIG_ESP_BROWNOUT_DET=y
CONFIG_ESP_BROWNOUT_DET_LVL_SEL_7=y
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y

# 当前阶段默认进入 USB/Web 运维模式，确保 get_status、get_sensors 和网络配置面板可直接工作。
CONFIG_FRIDGE_SCREEN_TEST=n
CONFIG_FRIDGE_SCREEN_TEST_PCLK_HZ=10000000
CONFIG_FRIDGE_SCREEN_TEST_COLOR_HOLD_MS=3000
CONFIG_FRIDGE_SCREEN_TEST_REPORT_EVERY_CYCLES=10
# CONFIG_FRIDGE_SCREEN_TEST_VERBOSE_LOG is not set
CONFIG_FRIDGE_CAMERA_TEST=n
CONFIG_FRIDGE_CAMERA_XCLK_HZ=10000000
CONFIG_FRIDGE_CAMERA_PREVIEW_MAX_BYTES=65536

# AI API 测试使用 HTTPS 与系统证书包，不额外在固件中硬编码服务商证书。
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# ESP-SR WakeNet：第一版只加载官方“小滨小滨/小冰小冰”唤醒词模型。
# 模型烧录到 partitions.csv 中固定 label=model 的分区，保留双 OTA，不启用 MultiNet 命令词。
CONFIG_MODEL_IN_FLASH=y
CONFIG_AFE_INTERFACE_V1=y
CONFIG_SR_NSN_WEBRTC=y
CONFIG_SR_VADN_WEBRTC=y
CONFIG_SR_WN_WN9_XIAOBINXIAOBIN_TTS=y
CONFIG_SR_MN_CN_NONE=y
CONFIG_SR_MN_EN_NONE=y

# 本地 720x720 LVGL UI。首版使用局部刷新行缓冲，绘图内存优先走 PSRAM。
CONFIG_FRIDGE_UI_ENABLE=y
CONFIG_LV_COLOR_DEPTH_16=y
# LVGL 默认内置 malloc 会在 .dram0.bss 放静态内存池；ESP32-S3 上会挤压内部 SRAM。
# 改用 C 库 malloc，让 LVGL 小对象走 ESP-IDF heap，行缓冲仍由 UI 组件显式放到 PSRAM。
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_BUILTIN_MALLOC=n
CONFIG_LV_USE_PERF_MONITOR=n

# 固件只使用项目自建页面，不编译 LVGL examples/demo，减少镜像体积和静态 RAM 占用。
CONFIG_LV_BUILD_EXAMPLES=n
CONFIG_LV_USE_DEMO_WIDGETS=n
CONFIG_LV_USE_DEMO_KEYPAD_AND_ENCODER=n
CONFIG_LV_USE_DEMO_BENCHMARK=n
CONFIG_LV_USE_DEMO_RENDER=n
CONFIG_LV_USE_DEMO_SCROLL=n
CONFIG_LV_USE_DEMO_STRESS=n
CONFIG_LV_USE_DEMO_TRANSFORM=n
CONFIG_LV_USE_DEMO_MUSIC=n
CONFIG_LV_USE_DEMO_FLEX_LAYOUT=n
CONFIG_LV_USE_DEMO_MULTILANG=n
CONFIG_LV_USE_DEMO_VECTOR_GRAPHIC=n
